English/NCE3/L10 The loss of the Titanic.org
#+OPTIONS: \n:t toc:nil num:nil html-postamble:nil
#+HTML_HEAD_EXTRA: <style>body {background: rgb(193, 230, 198) !important;}</style>
* Lesson 10 The loss of the Titanic
#+begin_verse
What would have happened if only two of the sixteen water-tight compartments had been flooded?

The great ship, Titanic, sailed for New York from Southampton on April 10th, 1912.
She was carrying 1,316 passengers and *a crew of* 891.
Even by modern standards, the 46,000 ton Titanic was a colossal ship.
At that time, however, she was not only the largest ship that had ever been built,
		but *was regarded as* unsinkable,
	for she had sixteen watertight compartments.
Even if two of these were flooded, she would still be able to float.
The tragic sinking of this great liner will always be remembered,
	for she went down on her first voyage with heavy loss of life.

Four days after setting out,
	while the Titanic was sailing across the icy waters of the North Atlantic,
	a huge iceberg was suddenly spotted by a lookout.
After the *alarm had been given*, the great ship turned sharply to avoid a direct collision.
The Titanic turned just *in time*, narrowly missing the immense wall of ice
	which rose over 100 feet out of the water beside her.
Suddenly, there was a slight trembling sound from below,
	and the captain went down to see what had happened.
The noise had been so faint that no one thought that the ship had been damaged.
Below, the captain *realized to his horror that* the Titanic was sinking rapidly,
	for five of her sixteen watertight compartments had already been flooded!
*The order to abandon ship was given* and hundreds of people plunged into the icy water.
As there were not enough lifeboats for everybody, 1,500 lives were lost.
#+end_verse
** expression
Southampton: [saʊθ'hæmptənˌ saʊ'θæmp-]
colossal: [kəˈlɑs(ə)l] adj.庞大的
watertight: [ˈwɔtərˌtaɪt] adj.不漏水的
compartment: [kəmˈpɑrtmənt] n.(轮船的)密封舱
flood: [flʌd] v.充满水
float: [floʊt] v.漂浮,漂浮
tragic: [ˈtrædʒɪk] adj.悲惨的
liner: [ˈlaɪnər] n. a large ship for passengers班船
voyage: [ˈvɔɪɪdʒ] n.航行
iceberg: [ˈaɪsˌbɜrɡ] n.冰山
lookout: [ˈlʊkˌaʊt] n. someone whose duty is to watch carefully for something, especially for danger瞭望员
collision: [kəˈlɪʒ(ə)n] n.碰撞
narrowly: [ˈneroʊli] adv.刚刚,勉强地
miss: [mɪs] v.避开
slight: [slaɪt] adj.轻微的
tremble: [ˈtremb(ə)l] v.  to shake slightly in a way that you cannot control, especially because you are upset or frightened震颤
faint: [feɪnt] adj.微弱的
horror: [ˈhɔrər] n.  to sb's horror  horror movie恐惧
abandon: [əˈbændən] v.抛弃
plunge: [plʌndʒ] v.投入, 跳入
lifeboat: [ˈlaɪfˌboʊt] n.救生船
--------------------
a crew of: eg. ~ workers; ~ painter; ~ waiters一群...
be regarded as + adj./n.: 被认为是
give an alarm: give a warn of danger发出警报
in time: not late; punctual.及时
realized to his horror that: 惊恐的意识到...
give an order: 下命令

** words
Southampton [saʊθ'hæmptən] n. 南安普敦
colossal [kəˈlɑs(ə)l] adj. 庞大的
watertight [ˈwɔtərˌtaɪt] adj. 不漏水的
compartment [kəmˈpɑrtmənt] n. 轮船的密封舱
flood [flʌd] v. 充满水
float [floʊt] v. 漂浮
tragic [ˈtrædʒɪk] adj. 悲惨的
liner [ˈlaɪnər] n. 班船
voyage [ˈvɔɪɪdʒ] n. 航行
iceberg [ˈaɪsˌbɜrɡ] n. 冰山
lookout [ˈlʊkˌaʊt] n. 瞭望员
collision [kəˈlɪʒ(ə)n] n. 碰撞
narrowly [ˈneroʊli] adv. 刚刚,勉强地
miss [mɪs] v. 避开
slight [slaɪt] adj. 轻微的
faint [feɪnt] adj. 微弱的
horror [ˈhɔrər] n. 恐惧
abandon [əˈbændən] v. 抛弃
plunge [plʌndʒ] v. 投入,跳入
lifeboat [ˈlaɪfˌboʊt] n. 救生船

** Vocabulary
colossal: immense,huge
regarded: considered, thought to be
compartments: sections,divisions
flooded: filled with water
float: stay on the surface of the water
avoid: escape, miss
narrowly: only just

