NCE3/L10 The loss of the Titanic.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-09-28 Sat 22:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="DESKTOP-13B7HQM" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-orgf659e00" class="outline-2">
<h2 id="orgf659e00">Lesson 10 The loss of the Titanic</h2>
<div class="outline-text-2" id="text-orgf659e00">
<p class="verse">
What would have happened if only two of the sixteen water-tight compartments had been flooded?<br />
<br />
The great ship, Titanic, sailed for New York from Southampton on April 10th, 1912.<br />
She was carrying 1,316 passengers and <b>a crew of</b> 891.<br />
Even by modern standards, the 46,000 ton Titanic was a colossal ship.<br />
At that time, however, she was not only the largest ship that had ever been built,<br />
&#xa0;&#xa0;but <b>was regarded as</b> unsinkable,<br />
&#xa0;for she had sixteen watertight compartments.<br />
Even if two of these were flooded, she would still be able to float.<br />
The tragic sinking of this great liner will always be remembered,<br />
&#xa0;for she went down on her first voyage with heavy loss of life.<br />
<br />
Four days after setting out,<br />
&#xa0;while the Titanic was sailing across the icy waters of the North Atlantic,<br />
&#xa0;a huge iceberg was suddenly spotted by a lookout.<br />
After the <b>alarm had been given</b>, the great ship turned sharply to avoid a direct collision.<br />
The Titanic turned just <b>in time</b>, narrowly missing the immense wall of ice<br />
&#xa0;which rose over 100 feet out of the water beside her.<br />
Suddenly, there was a slight trembling sound from below,<br />
&#xa0;and the captain went down to see what had happened.<br />
The noise had been so faint that no one thought that the ship had been damaged.<br />
Below, the captain <b>realized to his horror that</b> the Titanic was sinking rapidly,<br />
&#xa0;for five of her sixteen watertight compartments had already been flooded!<br />
<b>The order to abandon ship was given</b> and hundreds of people plunged into the icy water.<br />
As there were not enough lifeboats for everybody, 1,500 lives were lost.<br />
</p>
</div>
<div id="outline-container-orgecf2b79" class="outline-3">
<h3 id="orgecf2b79">expression</h3>
<div class="outline-text-3" id="text-orgecf2b79">
<p>
Southampton: [saʊθ'hæmptənˌ saʊ'θæmp-]<br />
colossal: [kəˈlɑs(ə)l] adj.庞大的<br />
watertight: [ˈwɔtərˌtaɪt] adj.不漏水的<br />
compartment: [kəmˈpɑrtmənt] n.(轮船的)密封舱<br />
flood: [flʌd] v.充满水<br />
float: [floʊt] v.漂浮,漂浮<br />
tragic: [ˈtrædʒɪk] adj.悲惨的<br />
liner: [ˈlaɪnər] n. a large ship for passengers班船<br />
voyage: [ˈvɔɪɪdʒ] n.航行<br />
iceberg: [ˈaɪsˌbɜrɡ] n.冰山<br />
lookout: [ˈlʊkˌaʊt] n. someone whose duty is to watch carefully for something, especially for danger瞭望员<br />
collision: [kəˈlɪʒ(ə)n] n.碰撞<br />
narrowly: [ˈneroʊli] adv.刚刚,勉强地<br />
miss: [mɪs] v.避开<br />
slight: [slaɪt] adj.轻微的<br />
tremble: [ˈtremb(ə)l] v.  to shake slightly in a way that you cannot control, especially because you are upset or frightened震颤<br />
faint: [feɪnt] adj.微弱的<br />
horror: [ˈhɔrər] n.  to sb's horror  horror movie恐惧<br />
abandon: [əˈbændən] v.抛弃<br />
plunge: [plʌndʒ] v.投入, 跳入<br />
lifeboat: [ˈlaɪfˌboʊt] n.救生船<br />
</p>
<hr />
<p>
a crew of: eg. ~ workers; ~ painter; ~ waiters一群&#x2026;<br />
be regarded as + adj./n.: 被认为是<br />
give an alarm: give a warn of danger发出警报<br />
in time: not late; punctual.及时<br />
realized to his horror that: 惊恐的意识到&#x2026;<br />
give an order: 下命令<br />
</p>
</div>
</div>

<div id="outline-container-org10bb970" class="outline-3">
<h3 id="org10bb970">words</h3>
<div class="outline-text-3" id="text-org10bb970">
<p>
Southampton [saʊθ'hæmptən] n. 南安普敦<br />
colossal [kəˈlɑs(ə)l] adj. 庞大的<br />
watertight [ˈwɔtərˌtaɪt] adj. 不漏水的<br />
compartment [kəmˈpɑrtmənt] n. 轮船的密封舱<br />
flood [flʌd] v. 充满水<br />
float [floʊt] v. 漂浮<br />
tragic [ˈtrædʒɪk] adj. 悲惨的<br />
liner [ˈlaɪnər] n. 班船<br />
voyage [ˈvɔɪɪdʒ] n. 航行<br />
iceberg [ˈaɪsˌbɜrɡ] n. 冰山<br />
lookout [ˈlʊkˌaʊt] n. 瞭望员<br />
collision [kəˈlɪʒ(ə)n] n. 碰撞<br />
narrowly [ˈneroʊli] adv. 刚刚,勉强地<br />
miss [mɪs] v. 避开<br />
slight [slaɪt] adj. 轻微的<br />
faint [feɪnt] adj. 微弱的<br />
horror [ˈhɔrər] n. 恐惧<br />
abandon [əˈbændən] v. 抛弃<br />
plunge [plʌndʒ] v. 投入,跳入<br />
lifeboat [ˈlaɪfˌboʊt] n. 救生船<br />
</p>
</div>
</div>

<div id="outline-container-orgf152dd9" class="outline-3">
<h3 id="orgf152dd9">Vocabulary</h3>
<div class="outline-text-3" id="text-orgf152dd9">
<p>
colossal: immense,huge<br />
regarded: considered, thought to be<br />
compartments: sections,divisions<br />
flooded: filled with water<br />
float: stay on the surface of the water<br />
avoid: escape, miss<br />
narrowly: only just<br />
</p>
</div>
</div>
