English/NCE3/L10 The loss of the Titanic.org
** DONE 单词造句
CLOSED: [2023-11-06 Mon 19:35]
Southampton
colossal adj.
- Instead of catching fishes, I catch nothing. This is a colossal waste of time.
- The colossal has been burnt down last night for one reason or another.
- To our surprise, there is a colossal wooden statue in his garden.
- Somehow, I have made such a colossal mistake.
- If you didn't make such a colossal mistake, you wouldn't be fired.
watertight adj.
- If I didn't wear watertight clothes, I would be in difficulty now.
- As long as the tire is watertight, we will be safe now.
- I learned to make a watertight bag in the factory.
- These clothes have one thing in common: they are watertight.
- He is making a study of the watertight compartment.
compartment n.
- The detective pointed out that the house has a compartment.
- The compartment used to be connected to the garage.
- The compartment of the house hasn't been found for hundreds of years.
- The flight attendant lost her temper, for the customer was reluctant to leave the compartment.
- No one has been allowed to live in compartents.
flood v.
- Imagine my wife's dismay when she found out that the kitchen was flooded.
- The authorities confirmed that all villages have been flooded.
- The boys went to extremes to flood the garage.
- Even if two of the compartments were flooded, the ship would still be able to float.
- Because the room was flooded, I have to deal with it for a long time.
float v.
- The lookout claimed to have spotted some leaves floating on the water.
- The captain found the body floating nearby and call out to the police.
- We couldn't swim in the river, for the simple reason that the boat is floating nearby.
- This turned out to be a boat floating on the river.
- The man love to sit in a boat floating on the river.
tragic adj.
- She decided to make a sacrifice when she heard the tragic news.
- When the tragic news arrived, all of us bursted into tears.
- This is tragic news, and I felt oblige to keep the secret.
- My cat died from a tragic accident last year.
- I was just wondering what was the tragic news.
liner n.
- She never dreamed of sailing to America in a large liner.
- I woke up with a start, realizing that I was in a large liner.
- The ocean liner was said to sail for Shanghai from New York.
- He used to be a waiter who worked on a large liner.
- Suddenly a large liner was spotted by a lookout.
voyage n.
- She must have been a passenger on our first voyage.
- You will have a happy voyage to London.
- I thought we need to rest after a long voyage.
- She loves to sail out at sea after her first voyage.
- It is well known that the colossal ship sank on her first voyage.
iceberg n.
- The lookout claimed to have seen an iceberg.
- The tragic news came to America that the liner had hit an iceberg.
- He is fanatical about iceberg.
- He caught sight of a figure which seems to be an iceberg.
- It is disturbing to think that the ship may hit an iceberg in the icy waters of Atlantic.
lookout n.
- The look out died from a tragic accident.
- This entitle the lookout to live in the compartment.
- The lookout lost his nerve when he spotted  a huge iceberg.
- It was not long before the lookout died of a rare disease.
- The lookout claimed to have seen an iceberg moving in front of the ship.
collision n.
- The busman and I turned sharply to avoid a collision.
- The actor took precaution in a colllision so that no one can recognize him.
- The detective made a study of traffic collisions in the city.
- It is fortunate that no one was injuried in the collision.
- The report came to the Zoo that five elephants were injuried in a collision.
narrowly adv.
- Alan was said to narrowly avoid an accident.
- I narrowly missed the man who stole my wallet last night.
- He has narrowly won the elections.
- She stated that she narrowly failed the exam.
- The lucky woman narrowly broke the world record.
miss v.
- He missed his exam, for he was too late.
- If you didn't miss lunch, you wouldn't be so hungry.
- If I didn't miss her, I would get married to her now.
- It is still possible to miss the train if you don't hurry to the station.
- Although we missed the chance, we should put forward our plan.
slight adj.
- He takes his job so seriously that he still went to work while getting a slight fever.
- If you get a slight fever, you should go home.
- I should warn you, there's only a slight chance it works.
- We will stick to our plan which wll make a slight change.
- These old builds have made a slight change for hundreds of years.
tremble v.
- My body is likely to tremble when I lose nerve.
- You needn't have threatened to kill him, because his whole body is trembling now.
- My body is out of control and trembling all the time.
- It is considered unlucky for somebody trembling in front of the goddess.
- I am expected to tremble and make a spectabcle of myself.
faint adj.
- The faint noise they make, the more likely we are to use them.
- She claimed to have heard a faint sound from the compartment.
- As long as there is a faint sound, the dog will recognize it.
- Seeing a faint light, the vicar went up to find out what had happened.
- My wife always detects a faint smell of perfume when I meet other women.
horror n.  to sb's horror  horror movie
- A circle of friends are watching a Japanese horror movie together.
- To my horror, I found my brother beautiful.
- To his horror, he found that his legs had been mutilated.
- To my horror, I was mutilated in the tragic accident.
- To her horror, she forgets to provide them with background music.
abandon v.
- The abandoned ship is floating on the river.
- Well, you are busy abandoning your children.
- She has written an article on abandoned dogs.
- In the end, the girl got impatient and decided to abandon her cat.
- Who entitles you to abandon your dogs?
plunge v.
- We are not allowed to plunge into water.
- Don't even try to plunge into water and get such a mess.
- If you plunge into water again, we will kick your ass.
- If you didn't plunge into water, we would be swimming now.
- People in this town who do manual work love to plunge into water after their work.
lifeboat n.
- Why don't you sacrifice some money for a lifeboat?
- I have the privilege of using the lifeboat.
- There are not enough lifeboats on the river.
- The man who owns a lifeboat often makes a sacrifice.
- The man who owns a lifeboat used to be a waiter working on a colossal ship.
** DONE 反复听电影片段直到懂关键句
CLOSED: [2023-11-06 Mon 20:00]
** 复习二册语法(笔记或视频) & 红皮书
