NCE3/L10 The loss of the Titanic.html

<div id="outline-container-org4a34038" class="outline-3">
<h3 id="org4a34038"><span class="done DONE">DONE</span> 单词造句</h3>
<div class="outline-text-3" id="text-org4a34038">
<p>
Southampton<br />
colossal adj.<br />
</p>
<ul class="org-ul">
<li>Instead of catching fishes, I catch nothing. This is a colossal waste of time.<br /></li>
<li>The colossal has been burnt down last night for one reason or another.<br /></li>
<li>To our surprise, there is a colossal wooden statue in his garden.<br /></li>
<li>Somehow, I have made such a colossal mistake.<br /></li>
<li>If you didn't make such a colossal mistake, you wouldn't be fired.<br /></li>
</ul>
<p>
watertight adj.<br />
</p>
<ul class="org-ul">
<li>If I didn't wear watertight clothes, I would be in difficulty now.<br /></li>
<li>As long as the tire is watertight, we will be safe now.<br /></li>
<li>I learned to make a watertight bag in the factory.<br /></li>
<li>These clothes have one thing in common: they are watertight.<br /></li>
<li>He is making a study of the watertight compartment.<br /></li>
</ul>
<p>
compartment n.<br />
</p>
<ul class="org-ul">
<li>The detective pointed out that the house has a compartment.<br /></li>
<li>The compartment used to be connected to the garage.<br /></li>
<li>The compartment of the house hasn't been found for hundreds of years.<br /></li>
<li>The flight attendant lost her temper, for the customer was reluctant to leave the compartment.<br /></li>
<li>No one has been allowed to live in compartents.<br /></li>
</ul>
<p>
flood v.<br />
</p>
<ul class="org-ul">
<li>Imagine my wife's dismay when she found out that the kitchen was flooded.<br /></li>
<li>The authorities confirmed that all villages have been flooded.<br /></li>
<li>The boys went to extremes to flood the garage.<br /></li>
<li>Even if two of the compartments were flooded, the ship would still be able to float.<br /></li>
<li>Because the room was flooded, I have to deal with it for a long time.<br /></li>
</ul>
<p>
float v.<br />
</p>
<ul class="org-ul">
<li>The lookout claimed to have spotted some leaves floating on the water.<br /></li>
<li>The captain found the body floating nearby and call out to the police.<br /></li>
<li>We couldn't swim in the river, for the simple reason that the boat is floating nearby.<br /></li>
<li>This turned out to be a boat floating on the river.<br /></li>
<li>The man love to sit in a boat floating on the river.<br /></li>
</ul>
<p>
tragic adj.<br />
</p>
<ul class="org-ul">
<li>She decided to make a sacrifice when she heard the tragic news.<br /></li>
<li>When the tragic news arrived, all of us bursted into tears.<br /></li>
<li>This is tragic news, and I felt oblige to keep the secret.<br /></li>
<li>My cat died from a tragic accident last year.<br /></li>
<li>I was just wondering what was the tragic news.<br /></li>
</ul>
<p>
liner n.<br />
</p>
<ul class="org-ul">
<li>She never dreamed of sailing to America in a large liner.<br /></li>
<li>I woke up with a start, realizing that I was in a large liner.<br /></li>
<li>The ocean liner was said to sail for Shanghai from New York.<br /></li>
<li>He used to be a waiter who worked on a large liner.<br /></li>
<li>Suddenly a large liner was spotted by a lookout.<br /></li>
</ul>
<p>
voyage n.<br />
</p>
<ul class="org-ul">
<li>She must have been a passenger on our first voyage.<br /></li>
<li>You will have a happy voyage to London.<br /></li>
<li>I thought we need to rest after a long voyage.<br /></li>
<li>She loves to sail out at sea after her first voyage.<br /></li>
<li>It is well known that the colossal ship sank on her first voyage.<br /></li>
</ul>
<p>
iceberg n.<br />
</p>
<ul class="org-ul">
<li>The lookout claimed to have seen an iceberg.<br /></li>
<li>The tragic news came to America that the liner had hit an iceberg.<br /></li>
<li>He is fanatical about iceberg.<br /></li>
<li>He caught sight of a figure which seems to be an iceberg.<br /></li>
<li>It is disturbing to think that the ship may hit an iceberg in the icy waters of Atlantic.<br /></li>
</ul>
<p>
lookout n.<br />
</p>
<ul class="org-ul">
<li>The look out died from a tragic accident.<br /></li>
<li>This entitle the lookout to live in the compartment.<br /></li>
<li>The lookout lost his nerve when he spotted  a huge iceberg.<br /></li>
<li>It was not long before the lookout died of a rare disease.<br /></li>
<li>The lookout claimed to have seen an iceberg moving in front of the ship.<br /></li>
</ul>
<p>
collision n.<br />
</p>
<ul class="org-ul">
<li>The busman and I turned sharply to avoid a collision.<br /></li>
<li>The actor took precaution in a colllision so that no one can recognize him.<br /></li>
<li>The detective made a study of traffic collisions in the city.<br /></li>
<li>It is fortunate that no one was injuried in the collision.<br /></li>
<li>The report came to the Zoo that five elephants were injuried in a collision.<br /></li>
</ul>
<p>
narrowly adv.<br />
</p>
<ul class="org-ul">
<li>Alan was said to narrowly avoid an accident.<br /></li>
<li>I narrowly missed the man who stole my wallet last night.<br /></li>
<li>He has narrowly won the elections.<br /></li>
<li>She stated that she narrowly failed the exam.<br /></li>
<li>The lucky woman narrowly broke the world record.<br /></li>
</ul>
<p>
miss v.<br />
</p>
<ul class="org-ul">
<li>He missed his exam, for he was too late.<br /></li>
<li>If you didn't miss lunch, you wouldn't be so hungry.<br /></li>
<li>If I didn't miss her, I would get married to her now.<br /></li>
<li>It is still possible to miss the train if you don't hurry to the station.<br /></li>
<li>Although we missed the chance, we should put forward our plan.<br /></li>
</ul>
<p>
slight adj.<br />
</p>
<ul class="org-ul">
<li>He takes his job so seriously that he still went to work while getting a slight fever.<br /></li>
<li>If you get a slight fever, you should go home.<br /></li>
<li>I should warn you, there's only a slight chance it works.<br /></li>
<li>We will stick to our plan which wll make a slight change.<br /></li>
<li>These old builds have made a slight change for hundreds of years.<br /></li>
</ul>
<p>
tremble v.<br />
</p>
<ul class="org-ul">
<li>My body is likely to tremble when I lose nerve.<br /></li>
<li>You needn't have threatened to kill him, because his whole body is trembling now.<br /></li>
<li>My body is out of control and trembling all the time.<br /></li>
<li>It is considered unlucky for somebody trembling in front of the goddess.<br /></li>
<li>I am expected to tremble and make a spectabcle of myself.<br /></li>
</ul>
<p>
faint adj.<br />
</p>
<ul class="org-ul">
<li>The faint noise they make, the more likely we are to use them.<br /></li>
<li>She claimed to have heard a faint sound from the compartment.<br /></li>
<li>As long as there is a faint sound, the dog will recognize it.<br /></li>
<li>Seeing a faint light, the vicar went up to find out what had happened.<br /></li>
<li>My wife always detects a faint smell of perfume when I meet other women.<br /></li>
</ul>
<p>
horror n.  to sb's horror  horror movie<br />
</p>
<ul class="org-ul">
<li>A circle of friends are watching a Japanese horror movie together.<br /></li>
<li>To my horror, I found my brother beautiful.<br /></li>
<li>To his horror, he found that his legs had been mutilated.<br /></li>
<li>To my horror, I was mutilated in the tragic accident.<br /></li>
<li>To her horror, she forgets to provide them with background music.<br /></li>
</ul>
<p>
abandon v.<br />
</p>
<ul class="org-ul">
<li>The abandoned ship is floating on the river.<br /></li>
<li>Well, you are busy abandoning your children.<br /></li>
<li>She has written an article on abandoned dogs.<br /></li>
<li>In the end, the girl got impatient and decided to abandon her cat.<br /></li>
<li>Who entitles you to abandon your dogs?<br /></li>
</ul>
<p>
plunge v.<br />
</p>
<ul class="org-ul">
<li>We are not allowed to plunge into water.<br /></li>
<li>Don't even try to plunge into water and get such a mess.<br /></li>
<li>If you plunge into water again, we will kick your ass.<br /></li>
<li>If you didn't plunge into water, we would be swimming now.<br /></li>
<li>People in this town who do manual work love to plunge into water after their work.<br /></li>
</ul>
<p>
lifeboat n.<br />
</p>
<ul class="org-ul">
<li>Why don't you sacrifice some money for a lifeboat?<br /></li>
<li>I have the privilege of using the lifeboat.<br /></li>
<li>There are not enough lifeboats on the river.<br /></li>
<li>The man who owns a lifeboat often makes a sacrifice.<br /></li>
<li>The man who owns a lifeboat used to be a waiter working on a colossal ship.<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org62cce25" class="outline-3">
<h3 id="org62cce25"><span class="done DONE">DONE</span> 反复听电影片段直到懂关键句</h3>
<div class="outline-text-3" id="text-org62cce25">
</div>
</div>
<div id="outline-container-org723c8cb" class="outline-3">
<h3 id="org723c8cb">复习二册语法(笔记或视频) &amp; 红皮书</h3>
</div>
