English/NCE3/L10 The loss of the Titanic.org
** DONE 习惯用法造句
CLOSED: [2023-11-06 Mon 19:52]
a crew of
- He will be writting an article on a crew of workers in the theater.
- Did a crew of painter go into a high-rise building?
- He is telling a story which is based on a crew of waiters.
- A crew of waiters are watching a Japanese horror movie.
- To his horror, a crew of worker was setting his house on fire.
be regarded as + adj./n.
- The man who has red hair have been regarded as dangerous by police.
- It's disturbing to think that I am regarded as ugly by my wife.
- He has been regarded as dangerous by police for a period of time every year.
- She may have been regarded as the most beautiful woman in China.
- To his horror, he realized that he was regarded as dangerous by police.
give an alarm
- So long as you give an alarm, your children will rush out of the house.
- Now that the alarm was given, I am being considered as dangerous by people.
- So long as the alarm is given, the bus will come to stop.
- As long as the alarm was given, the workered stopped to rescue.
- If the alarm was given, there would be less people injuried.
in time
- The article has been published in time.
- My wife changed into her new dress in time.
- The girl is reluctant to finish her housework in time.
- Thanks to my classmate, I finish it in time.
- If you don't carry your identify card, you will not be here in time.
realized to his horror that
- I realized to my horror that my passwort had been stolen by that girl.
- I realized to my horror that she had fallen love in her teacher.
- I realized to my horror that he was equiped with a gun.
- I realized to my horror that I still didn't get enough money to study abroad.
- I realized to my horror that I had made a colossal mistake.
give an order
- Mr. Leo gave an order to read aloud.
- I gave an order to charge at the ball.
- The order to hit the balloon was given.
- The order to set the museum on fire was gaven.
- Why did you give such a stupid order?
** 跟读 50遍
** DONE Comprehension 反复练习
CLOSED: [2023-11-06 Mon 20:00]
** DONE Ask me if 写+读
CLOSED: [2023-11-06 Mon 20:12]
1. The Titanic sailed from Southampton. Where
	 Where did the Titanic sail from?
2. She was carrying 1,316 passengers. How many passengers
		How many passengers was she carrying?
3. She was regarded as unsinkable. Why
		Why was she regarded as unsinkable?
4. She had sixteen watertight compartments. How many
		How many watertight compartments did she have?
5. An iceberg was spotted. How many days after setting out
		How many days after setting out was an iceberg spotted?
6. The ship turned sharply. Why
	 Why did the ship turn sharply?
7. The wall of ice rose over 100 feet out of the water. How high
	 How high did the wall of ice rise?
8. The captain realized the ship was sinking. What
	 What did the captain realize?
9. Five of her compartments had been flooded. How many
	 How may of her compartments had been flooded?
10. 1,500 lives were lost. How many
		How many lives were lost?
	 
** DONE 摘要写作 写 & 对答案
CLOSED: [2023-11-06 Mon 20:21]
The Titanic was sailing across the icy waters of the North Atlantic
	when an iceberg was seen by a lookout.
After the alarm was given, the ship turned sharply and sail alongside it.
Suddenly, a faint noise was heard from below,
	so the captain went down to investigate,
	only to found that five of the sixteen compartments had been flooded.
On hearing the order to abandon ship, people jumped overboard,
	but 1,500 peole were drowned because there are not enough lifeboats for everyone.
	
** DONE tell the story 口语复述
CLOSED: [2023-11-06 Mon 20:26]
** DONE composition 阅读 或 写作
CLOSED: [2023-11-06 Mon 20:34]
The Titanic began to sink, slowly at first.
The order to abandon ship was unexpected, so passengers and crew were completely unprepared.
It was the middle of the night.
Some people were asleep in their cabins.
Others were on deck admiring the brilliant night sky and the giant icebergs rising above them.
Others were eating and dancing in the wonderful ballrooms on the ship.
The immediate effect was panic and confusion.
People began rushing in all directions, wondering what to do next.
The cold was indescribable and many passengers were still in their night clothes.

Members of the crew came up from below and began to lower the lifeboats.
It was a case of women and children first,
	but it soon became obvious that there weren't enough lifeboats for everyone,
	so people jumped overboard into the freezing water in order to save their lives.
Some of those swimming in the water struggled to get into the lifeboats,
	but most of them were already full.
The Titanic sank rapidly, carrying many people down with it.
There were cries of despair from people in the water
	as they watched the lifeboats moving away and were left to drown in the icy ocean.
** Topics for discussion
