NCE3/L10 The loss of the Titanic.html
<div id="outline-container-org5907c75" class="outline-3">
<h3 id="org5907c75"><span class="done DONE">DONE</span> 习惯用法造句</h3>
<div class="outline-text-3" id="text-org5907c75">
<p>
a crew of<br />
</p>
<ul class="org-ul">
<li>He will be writting an article on a crew of workers in the theater.<br /></li>
<li>Did a crew of painter go into a high-rise building?<br /></li>
<li>He is telling a story which is based on a crew of waiters.<br /></li>
<li>A crew of waiters are watching a Japanese horror movie.<br /></li>
<li>To his horror, a crew of worker was setting his house on fire.<br /></li>
</ul>
<p>
be regarded as + adj./n.<br />
</p>
<ul class="org-ul">
<li>The man who has red hair have been regarded as dangerous by police.<br /></li>
<li>It's disturbing to think that I am regarded as ugly by my wife.<br /></li>
<li>He has been regarded as dangerous by police for a period of time every year.<br /></li>
<li>She may have been regarded as the most beautiful woman in China.<br /></li>
<li>To his horror, he realized that he was regarded as dangerous by police.<br /></li>
</ul>
<p>
give an alarm<br />
</p>
<ul class="org-ul">
<li>So long as you give an alarm, your children will rush out of the house.<br /></li>
<li>Now that the alarm was given, I am being considered as dangerous by people.<br /></li>
<li>So long as the alarm is given, the bus will come to stop.<br /></li>
<li>As long as the alarm was given, the workered stopped to rescue.<br /></li>
<li>If the alarm was given, there would be less people injuried.<br /></li>
</ul>
<p>
in time<br />
</p>
<ul class="org-ul">
<li>The article has been published in time.<br /></li>
<li>My wife changed into her new dress in time.<br /></li>
<li>The girl is reluctant to finish her housework in time.<br /></li>
<li>Thanks to my classmate, I finish it in time.<br /></li>
<li>If you don't carry your identify card, you will not be here in time.<br /></li>
</ul>
<p>
realized to his horror that<br />
</p>
<ul class="org-ul">
<li>I realized to my horror that my passwort had been stolen by that girl.<br /></li>
<li>I realized to my horror that she had fallen love in her teacher.<br /></li>
<li>I realized to my horror that he was equiped with a gun.<br /></li>
<li>I realized to my horror that I still didn't get enough money to study abroad.<br /></li>
<li>I realized to my horror that I had made a colossal mistake.<br /></li>
</ul>
<p>
give an order<br />
</p>
<ul class="org-ul">
<li>Mr. Leo gave an order to read aloud.<br /></li>
<li>I gave an order to charge at the ball.<br /></li>
<li>The order to hit the balloon was given.<br /></li>
<li>The order to set the museum on fire was gaven.<br /></li>
<li>Why did you give such a stupid order?<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org6e2a435" class="outline-3">
<h3 id="org6e2a435">跟读 50遍</h3>
</div>
<div id="outline-container-org7ef3a0d" class="outline-3">
<h3 id="org7ef3a0d"><span class="done DONE">DONE</span> Comprehension 反复练习</h3>
<div class="outline-text-3" id="text-org7ef3a0d">
</div>
</div>
<div id="outline-container-orgdbd0b39" class="outline-3">
<h3 id="orgdbd0b39"><span class="done DONE">DONE</span> Ask me if 写+读</h3>
<div class="outline-text-3" id="text-orgdbd0b39">
<ol class="org-ol">
<li>The Titanic sailed from Southampton. Where<br />
Where did the Titanic sail from?<br /></li>
<li>She was carrying 1,316 passengers. How many passengers<br />
How many passengers was she carrying?<br /></li>
<li>She was regarded as unsinkable. Why<br />
Why was she regarded as unsinkable?<br /></li>
<li>She had sixteen watertight compartments. How many<br />
How many watertight compartments did she have?<br /></li>
<li>An iceberg was spotted. How many days after setting out<br />
How many days after setting out was an iceberg spotted?<br /></li>
<li>The ship turned sharply. Why<br />
Why did the ship turn sharply?<br /></li>
<li>The wall of ice rose over 100 feet out of the water. How high<br />
How high did the wall of ice rise?<br /></li>
<li>The captain realized the ship was sinking. What<br />
What did the captain realize?<br /></li>
<li>Five of her compartments had been flooded. How many<br />
How may of her compartments had been flooded?<br /></li>
<li>1,500 lives were lost. How many<br />
How many lives were lost?<br /></li>
</ol>
</div>
</div>

<div id="outline-container-org2738818" class="outline-3">
<h3 id="org2738818"><span class="done DONE">DONE</span> 摘要写作 写 &amp; 对答案</h3>
<div class="outline-text-3" id="text-org2738818">
<p>
The Titanic was sailing across the icy waters of the North Atlantic<br />
	when an iceberg was seen by a lookout.<br />
After the alarm was given, the ship turned sharply and sail alongside it.<br />
Suddenly, a faint noise was heard from below,<br />
	so the captain went down to investigate,<br />
	only to found that five of the sixteen compartments had been flooded.<br />
On hearing the order to abandon ship, people jumped overboard,<br />
	but 1,500 peole were drowned because there are not enough lifeboats for everyone.<br />
</p>
</div>
</div>

<div id="outline-container-orgf210ddf" class="outline-3">
<h3 id="orgf210ddf"><span class="done DONE">DONE</span> tell the story 口语复述</h3>
<div class="outline-text-3" id="text-orgf210ddf">
</div>
</div>
<div id="outline-container-orgac74394" class="outline-3">
<h3 id="orgac74394"><span class="done DONE">DONE</span> composition 阅读 或 写作</h3>
<div class="outline-text-3" id="text-orgac74394">
<p>
The Titanic began to sink, slowly at first.<br />
The order to abandon ship was unexpected, so passengers and crew were completely unprepared.<br />
It was the middle of the night.<br />
Some people were asleep in their cabins.<br />
Others were on deck admiring the brilliant night sky and the giant icebergs rising above them.<br />
Others were eating and dancing in the wonderful ballrooms on the ship.<br />
The immediate effect was panic and confusion.<br />
People began rushing in all directions, wondering what to do next.<br />
The cold was indescribable and many passengers were still in their night clothes.<br />
</p>

<p>
Members of the crew came up from below and began to lower the lifeboats.<br />
It was a case of women and children first,<br />
	but it soon became obvious that there weren't enough lifeboats for everyone,<br />
	so people jumped overboard into the freezing water in order to save their lives.<br />
Some of those swimming in the water struggled to get into the lifeboats,<br />
	but most of them were already full.<br />
The Titanic sank rapidly, carrying many people down with it.<br />
There were cries of despair from people in the water<br />
	as they watched the lifeboats moving away and were left to drown in the icy ocean.<br />
</p>
</div>
</div>
<div id="outline-container-org39e1961" class="outline-3">
<h3 id="org39e1961">Topics for discussion</h3>
</div>
</div>
</div>
</body>
</html>
